; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	infrared1 - mode
	Star2 - direction
	Star3 - direction
	Star1 - direction
	GroundStation4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Phenomenon5 spectrograph0)
	(have_image Star6 spectrograph0)
	(have_image Planet7 infrared1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 spectrograph0)
	(have_image Planet10 infrared1)
	(have_image Planet11 spectrograph0)
	(have_image Star12 infrared1)
	(have_image Planet13 infrared1)
	(have_image Star14 infrared1)
))

)

; plan
1. (turn_to satellite1 star1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star1)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 planet10 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet10)
   goals met: 0 of 11
5. (take_image satellite1 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon8 instrument1 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 2 of 11
8. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 11
9. (take_image satellite1 phenomenon5 instrument1 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 3 of 11
10. (turn_to satellite0 star14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star14)
   goals met: 4 of 11
11. (turn_to satellite1 planet11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet11)
   goals met: 4 of 11
12. (take_image satellite1 planet11 instrument1 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 5 of 11
13. (turn_to satellite1 planet13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet13)
   goals met: 5 of 11
14. (take_image satellite1 planet13 instrument1 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 6 of 11
15. (turn_to satellite1 planet7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet7)
   goals met: 6 of 11
16. (take_image satellite1 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 7 of 11
17. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 7 of 11
18. (take_image satellite1 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 8 of 11
19. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 8 of 11
20. (take_image satellite1 star12 instrument1 infrared1)
   added: (have_image star12 infrared1)
   goals met: 9 of 11
21. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 9 of 11
22. (take_image satellite1 star14 instrument1 infrared1)
   added: (have_image star14 infrared1)
   goals met: 10 of 11
23. (turn_to satellite1 star6 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star6)
   goals met: 10 of 11
24. (take_image satellite1 star6 instrument1 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 11 of 11
